{
  "title": "Dark Rising",
  "id": "dark-rising",
  "creator": "DarkRisingGirl",
  "initial_release": "2012-04-28",
  "base": "firered",
  "status": "complete",
  "pokedex": [
    "expanded",
    "backports",
    "new_moves"
  ],
  "story": "new",
  "description": "<p>Introduction Hi, I'm DarkRisingGirl & This is POKEMON Dark Rising. This is my 2nd attempt to complete a full hack with a new epic story, new characters, and a new region. I've always felt the Pokemon series needed a much stronger impact with story-telling & that's what this hack is all about. Within the hack(look to features for more information) you'll encounter Pokemon from all 5 generations, the newest attacks, and a brand new deep storyline involving many characters with actual emotions compelling them to move foward. I also forgot to mention 1 important thing; This hack is Part 1 of a hack series!</p><h2>The Adventure</h2><p>The Story begins in a dream. A Pokemon suddenly appears and chooses you, a young boy/girl, to save not only it, but the world itself. You awake asking yourself questions. Deciding to ignore the dream for now, you step out into your home town known as Fells in the Core Region. Your best friend, who also had the same dream, stops you at the front door to inform you of an emergency message from the town's Professor. When you encounter the professor, he quickly informs you of the disasters and climate changes occuring all over the Core Region. His workers in panic, he asks you to visit the delivery station and pick up a package for him from Prof.Oak. As you set out on this simple task, you encounter a mysterious girl who appears to know knowledge of the dream you've had about a creature name DARUGIS. After recieving the package, a powerful pokemon is within you and your friend, Pete, sight. Eager to test your early skills against a powerful pokemon, you quickly engage in a battle with it. The pokemon uses it's powerful winds, easily defeating your pokemon and knocking you out in the process. After awakening in your room, you see Pete and your mother patiently waiting for your recovery. You soon begin to realize this is the start of a journey into many mysteries and powerful pokemon you can't wait to challenge.</p><h2>Features</h2><ul><li>386 Pokemon from regions Kanto, Johto, Hoenn, Sinnoh, & Unova, all appear.</li><li>There's 8 badges. Each gym leader will have his/her own signature Pokemon that is not obtainable in the hack.</li><li>All Original Characters & Trainers, including some fan favorites from the anime such as Ash Ketchum, Misty, Brock</li><li>Aside from the anime favorites, Yami Yugi from the YUGIOH Series will also have a short apperance in the hack as a Gym Leader.</li><li>There will be newer generation moves. Some to note are Shadow Claw, Roost, Scald, & plenty more.</li><li>DW Abilities (Yes that includes the overused fan favorites of Drizzle Poliwag, Drought Vulpix, & Speed Boost Torchic.)</li><li>All Pokemon will learn some of their best egg moves from gen 3-5 by level up instead of breeding.</li><li>Inside every pokemon center, there's a Nurse Joy & Doctor Roy. Doctor Roy will be the one to heal your POKEMON. Nurse Joy will be next to him and challenge you to a double battle along side Doctor Roy. This is helpful for exp points.</li></ul>",
  "links": {
    "PokéCommunity": "https://www.pokecommunity.com/threads/pokemon-dark-rising.279049/"
  }
}